# config.py
# Глобальные настройки для всего проекта

LEVEL_LOG = "INFO"
#LEVEL_LOG = "DEBUG"
ANONIM_TEXT="texts/anonim/anonim-8-bulichev-alisa.txt"
BASE_PATH = "texts/"
AUTHORS_LIST = ["pushkin", "lermontov", "tolstoy", "bulichev"]

# Параметры анализа
N_FEATURES = 17
FEATURE_LIST = [
    'Ср. длина предл.', 'Дипс. предл', 'Ср. длина абзаца',
    'Доля ?', 'Доля !', 'Доля ...', 'Прямая речь', 'Лекс. богатство', 'Доля сущ.',
    'Доля глаголов', 'Доля прилаг.', 'Ср. длина слова',
    'Запятые', 'Тире', 'Двоеточия', 'Доля союзов', 'Доля предлогов'
]
FEATURE_LIST_SHORT = [
        'Дл. Предл', 'Дисп.', 'Абз', '?', '!', '...', 'Прям. речь', 'TTR', 'Сущ', 'Глаг', 'Прил',
        'ДлСл', ',', '—', ':', 'Союз', 'Предлог'
    ]
SOFTENING = 0.3
